function solve(input) {

    let phonebook = {}; //създаваме обект
    for (let line of input) {//правим цикъл за да превъртим елементите от получения масив
        let tokens = line.split(' ');//взимаме първия ред и го разделяме с празено разстояние
        let name = tokens[0];//нулевия елемент от новия масив ни е името
        let number = tokens[1];//1ви индекс ни е номера
        phonebook[name] = number;//в обекта създаваме ключ който да съдържа 
        //името и да е равен на номера
    }
    for (let key in phonebook) {//правим нов цикъл който да върти ключовете на обекта
        console.log(`${key} -> ${phonebook[key]}`);//печатаме името и номера
        //  ${phonebook[key]} по този начин викаме стойноста на ключа в обекта
    }
}
solve(['Tim 0834212554',
'Peter 0877547887',
'Bill 0896543112',
'Tim 0876566344']
)