function amazingNumbers(num) {

    num = num.toString()//превръшщаме числото в стринг директно
    let sum = 0;//създаваме променлива която да ни запазва резултата от сбора на цифрите


    for (let i = 0; i < num.length; i++) {//създаваме цикъл от който да изтеглим символите от стринга 
        //един по един
        sum += Number(num[i]);//събираме всеки елемент от стринга превърнат в число 
        //Number(num[i])
    }
    let result = sum.toString().includes('9');//създаваме променлива която превръща сумираното число в стринг
    // и проверяваме дали сбора на цифрите е равен на 9
    console.log(result ? `${num} Amazing? True` : `${num} Amazing? False`);
    //в конзолата създаваме тернарен оператор който да ни каже сборът равен ли е на 9 или не 
}
amazingNumbers(1233)