function dayOfWeek(num) {
    if (num < 1 || num > 7) {
        console.log("Invalid day !");
    } else {
        let days = ["Monday", "Tuesday", "Wednesday",
            "Thursday",
            "Friday", "Saturday", "Sunday"]//създаваме масив с дните от седмицата 
        let index = num - 1//за да може всеки ден да отговаря на число създаваме променлива в която 
        //дефинираме превръщаме числото от входа в индекс като изваждаме една единица за 
        //да може да си отговаря с дължината на масива !!! 
        console.log(days[index]);//викаме името на масива който се намира под
        //дадения индекс(например ако числото на входа ни е 1 то се превръща в 0 
        //а нулевия елемент отоговаря на Monday от масива !!!!
    }


}
dayOfWeek(1)