let numbers = [1, 2, 3, 4, 5]

numbers.splice(2, 3);//(2=от кой индекс да започне ,3=колко елемента да изтрие)

console.log(numbers);
let numbers1 = [1, 2, 3, 4, 5]
numbers1.splice(0,2)
console.log(numbers1);
//когато използваме splice ,е  важно да се знае ,
//че конзолата връща модифициран оригиналния масив, не му прави копие
let digits=[1,2,3,4,5];
digits.splice(2,3,5,6,7);//(2=от кой индекс започваме,3=колко елемента от масива да махнем,5,6,7=елементи,които 
//добавяме)
console.log(digits);

let chars=['a','b','c','d'];
chars.splice(2,0,'z','q');//(2=от кой индекс започваме,0=не изтриваме нищо,z,q=елементите ,които 
//вмъкваме в масива от втори индекс,c,d=остават ['a', 'b', 'z', 'q', 'c', 'd'])
console.log(chars);